railsStudy-master/app/controllers/confirmations_controller.rb

	def show
		user = User.find_by(confirmation_token: params[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "lw55S552tUVKmEnheNKvTQ"], ["LIMIT", 1]]