railsStudy-master/app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" ORDER BY "rooms"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @rooms = Room.most_recent.map do |room|

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["room_id", 4], ["user_id", 17], ["LIMIT", 1]]
---
  def show
    if user_signed_in?
      @user_review = @room.reviews.find_or_initialize_by(user_id: current_user.id)

INSERT INTO "rooms" ("title", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Teste"], ["location", "Brasil"], ["description", "testando quarto brasil"], ["created_at", 2016-08-29 21:38:59 UTC], ["updated_at", 2016-08-29 21:38:59 UTC]]
---
  def create
    @room = current_user.rooms.build(room_params)

    if @room.save

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 3]]
---
  def destroy
    @room.destroy

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_room
    room_model = Room.find(params[:id])

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT ?  [["user_id", 17], ["id", 4], ["LIMIT", 1]]
---
  def set_users_room
    @room = current_user.rooms.find(params[:id])