railsStudy-master/app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "email", "location", "bio", "created_at", "updated_at", "password_digest", "confirmation_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "Testando Update"], ["updated_at", 2016-08-10 22:42:34 UTC], ["id", 6]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)